IDENTIFICATION DIVISION.
PROGRAM-ID. BUBBLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
 01 ARR OCCURS 5 TIMES PIC 9(2).
 01 I PIC 9.
 01 J PIC 9.
 01 TEMP PIC 9(2).
PROCEDURE DIVISION.
 PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
  ACCEPT ARR(I)
 END-PERFORM.
 
 PERFORM VARYING I FROM 1 BY 1 UNTIL I > 4
  PERFORM VARYING J FROM 1 BY 1 UNTIL J > 4
   IF ARR(J) > ARR(J + 1)
    MOVE ARR(J) TO TEMP
    MOVE ARR(J + 1) TO ARR(J)
    MOVE TEMP TO ARR(J + 1)
   END-IF
  END-PERFORM
 END-PERFORM. 
DISPLAY "ARRAY: "
 PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
 DISPLAY ARR(I)
 END-PERFORM.
STOP RUN.
