IDENTIFICATION DIVISION.
  PROGRAM-ID. CTOF.
  DATA DIVISION.
  WORKING-STORAGE SECTION.
    01 C PIC 9(2)V9.
    01 F PIC 9(2)V9.
    PROCEDURE DIVISION.
    ACCEPT C.
    DISPLAY "CELCIUS: " C.
    COMPUTE F=(C*9/5)=32.
    DISPLAY "FARENHEIT: "F.
    STOP RUN.
