IDENTIFICATION DIVISION.
  PROGRAM-ID. CI.
  DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 P PIC 9(5).
    01 N PIC 9(2).
    01 R PIC 9(2).
    01 CI PIC 9(5)V9.
    PROCEDURE DIVISION.
    ACCEPT P.
    ACCEPT N.
    ACCEPT R.
    DISPLAY "PRINCIPAL: "P.
    DISPLAY "YEARS: "N.
    DISPLAY "RATE: "R.
    COMPUTE CI = P[(1+R/100)**N - 1]
    DISPLAY "COMPOUND INTEREST: "CI.
    STOP RUN.
