IDENTIFICATION DIVISION.
  PROGRAM-ID. HELLO.
  DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 STR1 PIC A(10).
   01 STR2 PIC A(20).
   01 LEN PIC 9(2).
   01 FULL-STRING PIC A(50).
   PROCEDURE DIVISION.
   ACCEPT STR1.
   ACCEPT STR2.
    DISPLAY "STRING1: "STR1.
    DISPLAY "STRING2: "STR2.
   STRING STR1 DELIMITED BY SIZE , STR2 DELIMITED BY SIZE INTO FULL-STRING
   END-STRING.
   DISPLAY "FULL-STR: " FULL-STRING.
   COMPUTE LEN = FUNCTION LENGTH(FUNCTION TRIM(FULL-STRING)).
   DISPLAY "LENGTH: " LEN.
STOP RUN.
