IDENTIFICATION DIVISION.
PROGRAM-ID. DIVISIBLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 I PIC 9(4).
01 R1 PIC 9(3).
01 R2 PIC 9(3).
01 R3 PIC 9(3).
01 D PIC 9(4).
PROCEDURE DIVISION.
ACCEPT I.
PERFORM VARYING I FROM 1 BY 1 UNTIL I > 1000
       DIVIDE I BY 2 GIVING D REMAINDER R1
       DIVIDE I BY 3 GIVING D REMAINDER R2
       DIVIDE I BY 17 GIVING D REMAINDER R3
       IF R1 = 0 AND R2 = 0 AND R3 = 0
         DISPLAY I
       END-IF
END-PERFORM.
STOP RUN.
