IDENTIFICATION DIVISION.
  PROGRAM-ID. FACT.
  DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 NUM PIC 9(5).
    01 I PIC 9(5).
    01 FACT PIC 9(5) VALUE 1.
    PROCEDURE DIVISION.
    ACCEPT NUM.
    DISPLAY "ENTER THE NUM: " NUM.
    IF NUM=0
    MOVE 1 TO FACT
    ELSE
PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM
    MULTIPLY FACT BY I GIVING FACT
    END-PERFORM
    END-IF.
    DISPLAY "FACTORIAL: " FACT.
    STOP RUN.
