IDENTIFICATION DIVISION.
PROGRAM-ID. GRADE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MARK PIC 9(3).
PROCEDURE DIVISION.
ACCEPT MARK.
IF MARK >= 90
  DISPLAY "A GRADE"
ELSE IF MARK >=80 
  DISPLAY "B GRADE"
ELSE IF MARK >=70
  DISPLAY "C GRADE"
ELSE IF MARK >=60
  DISPLAY "D GRADE"
ELSE IF MARK >=70
  DISPLAY "E GRADE"
ELSE
  DISPLAY "F GRADE"
END-IF.
STOP RUN.
