IDENTIFICATION DIVISION.
 PROGRAM-ID. GREATER.
DATA DIVISION.
WORKING-STORAGE SECTION.
 01 A PIC 9(3).
 01 B PIC 9(3).
 01 C PIC 9(3).
PROCEDURE DIVISION.
 ACCEPT A.
 ACCEPT B.
 ACCEPT C.
 IF A > B AND A > C 
  DISPLAY "A IS GREATER"
 ELSE IF B > C 
  DISPLAY "B IS GREATER"
 ELSE
  DISPLAY "C IS GREATER"
 END-IF.
STOP RUN.
