IDENTIFICATION DIVISION.
 PROGRAM-ID. PRIME.
DATA DIVISION.
WORKING-STORAGE SECTION.
 01 N PIC 9(3).
 01 I PIC 9(3).
 01 D PIC 9(3).
 01 R PIC 9(2).
 01 FLAG PIC X.
PROCEDURE DIVISION.
 ACCEPT N.
 IF N <= 1
  DISPLAY "NOT PRIME"
  STOP RUN
 END-IF.
  MOVE 'Y' TO FLAG
  PERFORM VARYING I FROM 2 BY 1 UNTIL I = N 
   DIVIDE N BY I GIVING D REMAINDER R
   IF R = 0
    MOVE 'N' TO FLAG
    EXIT PROGRAM
   END-IF
  END-PERFORM
  IF FLAG ='Y'
   DISPLAY "PRIME"
  ELSE 
   DISPLAY "NOT PRIME"
  END-IF.
STOP RUN.
