IDENTIFICATION DIVISION.
  PROGRAM-ID. SI.
  DATA DIVSION.
  WORKING-STORAGE SECTION.
  01 P PIC 9(5).
    01 N PIC 9(2).
    01 R PIC 9(2).
    01 SI PIC 9(5)V9.
    PROCEDURE DIVISION.
    ACCEPT P.
    ACCEPT N.
    ACCEPT R.
    DISPLAY "PRINCIPAL: "P.
    DISPLAY "YEARS: "N.
    DISPLAY "RATE: "R.
    COMPUTE SI=(P*N*R)/100.
    DISPLAY "SIMPLE INTEREST: "SI.
    STOP RUN.
