IDENTIFICATION DIVISION.
  PROGRAM-ID. SUM.
  DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 ARR OCCURS 20 TIMES PIC 9(3).
   01 WS-SUM PIC 9(5) VALUE 0.
   01 I PIC 9(2).
   PROCEDURE DIVISION.
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > 20
   ACCEPT ARR(I)
   ADD ARR(I) TO WS-SUM
   END-PERFORM.
   DISPLAY "SUM OF 20 NUM: " WS-SUM.
   STOP RUN.
